In [1]:
import pandas as pd
import numpy as np

In [2]:
date  = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [7]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [12]:
date['date'] = pd.to_datetime(date['date'])

In [13]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

In [17]:
time['date'] = pd.to_datetime(time['date'])

In [31]:
date['day_name'] = date['date'].dt.day_name()

In [32]:
date.head()

,date,product_id,city_id,orders,data_year,data_month,data_day,month_name,dayofweek,day_name
0,2019-12-10,5628,25,3,2019,12,10,December,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,15,August,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,23,October,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,17,August,5,Saturday
4,2019-01-06,4344,25,3,2019,1,6,January,6,Sunday

In [36]:
# time['time'] = time['time'].dt.

In [35]:
date['date_is_weekend'] = np.where(date['day_name'].isin(['Sunday', 'Saturday']), 1,0)

date.drop(columns=['product_id','city_id','orders']).head()

,date,data_year,data_month,data_day,month_name,dayofweek,day_name,date_is_weekend
0,2019-12-10,2019,12,10,December,1,Tuesday,0
1,2018-08-15,2018,8,15,August,2,Wednesday,0
2,2018-10-23,2018,10,23,October,1,Tuesday,0
3,2019-08-17,2019,8,17,August,5,Saturday,1
4,2019-01-06,2019,1,6,January,6,Sunday,1

In [37]:
import datetime
today = datetime.datetime.today()

today

datetime.datetime(2024, 9, 18, 16, 48, 40, 1955)

In [38]:
today - date['date']

0     1744 days 16:48:40.001955
1     2226 days 16:48:40.001955
2     2157 days 16:48:40.001955
3     1859 days 16:48:40.001955
4     2082 days 16:48:40.001955
                 ...
995   2172 days 16:48:40.001955
996   2113 days 16:48:40.001955
997   1961 days 16:48:40.001955
998   2026 days 16:48:40.001955
999   1800 days 16:48:40.001955
Name: date, Length: 1000, dtype: timedelta64[ns]

In [39]:
(today - date['date']).dt.days

0      1744
1      2226
2      2157
3      1859
4      2082
       ...
995    2172
996    2113
997    1961
998    2026
999    1800
Name: date, Length: 1000, dtype: int64

In [41]:
np.round((today - date['date']) / np.timedelta64(1, 'D') / 30.44, 0)

0      57.0
1      73.0
2      71.0
3      61.0
4      68.0
       ...
995    71.0
996    69.0
997    64.0
998    67.0
999    59.0
Name: date, Length: 1000, dtype: float64

In [42]:
time

                   date                                                msg
0   2013-12-15 00:50:00                           ищу на сегодня мужика 37
1   2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2   2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3   2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4   2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
..                  ...                                                ...
995 2012-03-16 00:50:00     ПАРЕНЬ СДЕЛАЕТ  МАССАЖ ЖЕНЩИНАМ -066-877-32-44
996 2014-01-23 23:14:00            сельский п 23 ищу девушку для отношений
997 2012-10-15 23:37:00  Д+Д ДЛЯ серьезных отношений. Мой номер 093-156...
998 2012-06-21 23:34:00  7 ДНЕПР М.34 ПОЗ.С Д/Ж ДЛЯ ВСТРЕЧ.Т.098 809 15 14
999 2014-06-19 23:25:00          Парень поласкает девушке...  т.0662035584

[1000 rows x 2 columns]

In [43]:
time.head()

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4 2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [44]:
time['date'] = pd.to_datetime(time['date'])

In [45]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [46]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

In [47]:
time['time'] = time['date'].dt.time

time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

In [48]:
today - time['date']

0     3930 days 15:58:40.001955
1     3794 days 17:08:40.001955
2     4280 days 16:27:40.001955
3     3582 days 16:17:40.001955
4     3979 days 17:37:40.001955
                 ...
995   4569 days 15:58:40.001955
996   3890 days 17:34:40.001955
997   4355 days 17:11:40.001955
998   4471 days 17:14:40.001955
999   3743 days 17:23:40.001955
Name: date, Length: 1000, dtype: timedelta64[ns]

In [49]:
(today - time['date'])/np.timedelta64(1,'s')

0      3.396095e+08
1      3.278633e+08
2      3.698513e+08
3      3.095435e+08
4      3.438491e+08
           ...
995    3.948191e+08
996    3.361593e+08
997    3.763339e+08
998    3.863565e+08
999    3.234578e+08
Name: date, Length: 1000, dtype: float64

In [50]:
(today - time['date'])/np.timedelta64(1,'m')

0      5.660159e+06
1      5.464389e+06
2      6.164188e+06
3      5.159058e+06
4      5.730818e+06
           ...
995    6.580319e+06
996    5.602655e+06
997    6.272232e+06
998    6.439275e+06
999    5.390964e+06
Name: date, Length: 1000, dtype: float64

In [51]:
(today - time['date'])/np.timedelta64(1,'h')

0       94335.977778
1       91073.144445
2      102736.461112
3       85984.294445
4       95513.627778
           ...
995    109671.977778
996     93377.577778
997    104537.194445
998    107321.244445
999     89849.394445
Name: date, Length: 1000, dtype: float64